![](pic/mysql2.jpg)

## 복습: SELECT 문

<br><br>
<span style="color:blue; font-size: 1.2em;" >
SELECT&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;column, group_function(column)   
FROM&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;table  
[WHERE &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;condition]  
[GROUP BY&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;column]    
[HAVING &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;group_condition]  
[ORDER BY&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;column] ; </span>

<br><br><br><br><br><br>
**<span style="color:red">
다음 셀은 mysql DB와 편집기를 연결하는 명령입니다.  
수업을 시작할 때 마다 가장 먼저 실행하여야 합니다.**

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
%load_ext sql
%sql mysql://root:hannam@localhost/galaxy

C:\Users\PC-21\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xB4\\xEB\\xC7\\xD1\\xB9\\xCE...' for column 'VARIABLE_VALUE' at row 518")
  result = self._query(query)
C:\Users\PC-21\AppData\Local\Continuum\anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  result = self._query(query)

'Connected: root@galaxy'

## <span style="color:red">** 연습문제 **</span>

In [20]:
%%sql
drop table DEPT

 * mysql://root:***@localhost/galaxy
0 rows affected.

[]

<br><br>
<span style="color:red">[문제 1]</span>   
다음과 같은 열을 가진 테이블 DEPT를 만들고 잘 만들어졌는지 확인하라.
![](pic/pic9_7.jpg)

In [21]:
%%sql
create table DEPT(
        ID int(7),
        NAME varchar(25),
        PRIMARY KEY(id));

 * mysql://root:***@localhost/galaxy
0 rows affected.

[]

In [23]:
%%sql
select * from dept;

 * mysql://root:***@localhost/galaxy
0 rows affected.

[]

In [24]:
%%sql
select * from departments;

 * mysql://root:***@localhost/galaxy
14 rows affected.

[(10, 'Administration', 200, 1700),
 (20, 'Marketing', 201, 1800),
 (50, 'Shipping', 124, 1500),
 (60, 'IT', 103, 1400),
 (80, 'Sales', 149, 2500),
 (90, 'Executive', 100, 1700),
 (110, 'Accounting', 205, 1700),
 (190, 'Contracting', None, 1700),
 (270, 'Public Relations 270', 100, 1700),
 (370, 'Public Relations 370', 100, 1700),
 (470, 'Public Relations 470', None, None),
 (480, 'Public Relations 480', None, None),
 (570, 'Public Relations 570', None, None),
 (900, 'Data Science', None, None)]

<br><br>
<span style="color:red">[문제 2]</span>   
departments 테이블의 데이터를 DEPT 테이블에 추가하라. 필요한 열의 데이터만 추가하라.

In [27]:
%%sql
insert into dept(id,name) select department_id, department_name from departments;

 * mysql://root:***@localhost/galaxy
14 rows affected.

[]

In [28]:
%%sql
select * from dept;

 * mysql://root:***@localhost/galaxy
14 rows affected.

[(10, 'Administration'),
 (20, 'Marketing'),
 (50, 'Shipping'),
 (60, 'IT'),
 (80, 'Sales'),
 (90, 'Executive'),
 (110, 'Accounting'),
 (190, 'Contracting'),
 (270, 'Public Relations 270'),
 (370, 'Public Relations 370'),
 (470, 'Public Relations 470'),
 (480, 'Public Relations 480'),
 (570, 'Public Relations 570'),
 (900, 'Data Science')]

<br><br>
<span style="color:red">[문제 3]</span>   
다음과 같은 열을 가진 테이블 EMP를 만들고 잘 만들어졌는지 확인하라.
![](pic/pic9_8.jpg)
<span style="color:orange">

In [32]:
%%sql
create table EMP(
        ID int(7),
        LAST_NAME varchar(25),
        FIRST_NAME varchar(25),
        DEPT_ID int(7),
        FOREIGN KEY (DEPT_ID) REFERENCES DEPT(ID)
        );

 * mysql://root:***@localhost/galaxy
0 rows affected.

[]

In [34]:
%%sql
desc emp

 * mysql://root:***@localhost/galaxy
4 rows affected.

[('ID', 'int(7)', 'YES', '', None, ''),
 ('LAST_NAME', 'varchar(25)', 'YES', '', None, ''),
 ('FIRST_NAME', 'varchar(25)', 'YES', '', None, ''),
 ('DEPT_ID', 'int(7)', 'YES', 'MUL', None, '')]

<br><br>
<span style="color:red">[문제 4]</span>   
긴 성을 가진 사원의 성을 표시할 수 있도록, EMP 테이블의 LAST_NAME의 크기를 varchar(50)으로 고치고 확인하라.

In [35]:
%%sql
ALTER TABLE EMP
MODIFY COLUMN LAST_NAME varchar(50);

 * mysql://root:***@localhost/galaxy
0 rows affected.

[]

In [36]:
%%sql
desc emp;

 * mysql://root:***@localhost/galaxy
4 rows affected.

[('ID', 'int(7)', 'YES', '', None, ''),
 ('LAST_NAME', 'varchar(50)', 'YES', '', None, ''),
 ('FIRST_NAME', 'varchar(25)', 'YES', '', None, ''),
 ('DEPT_ID', 'int(7)', 'YES', 'MUL', None, '')]

In [38]:
%%sql
desc employees;

 * mysql://root:***@localhost/galaxy
11 rows affected.

[('employee_id', 'int(6)', 'NO', 'PRI', None, ''),
 ('first_name', 'varchar(20)', 'YES', '', None, ''),
 ('last_name', 'varchar(25)', 'NO', 'MUL', None, ''),
 ('email', 'varchar(25)', 'NO', 'UNI', None, ''),
 ('phone_number', 'varchar(20)', 'YES', '', None, ''),
 ('hire_date', 'date', 'NO', '', None, ''),
 ('job_id', 'varchar(10)', 'NO', 'MUL', None, ''),
 ('salary', 'decimal(8,2)', 'YES', '', None, ''),
 ('commission_pct', 'decimal(2,2)', 'YES', '', None, ''),
 ('manager_id', 'int(6)', 'YES', 'MUL', None, ''),
 ('department_id', 'int(4)', 'YES', 'MUL', None, '')]

<br><br>
<span style="color:red">[문제 5]</span>   
employees 테이블 구조를 기반으로 employees99 테이블을 만들라. employee_id, first_name, last_name, salary 및 department_id 열만 포함시키고, 새 테이블의 열 이름을 각각 ID, first_name, last_name, salary 및 dept_id 로 지정하라.

In [40]:
%%sql
create table employees99 as select employee_id, first_name, last_name, salary, department_id from employees;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[]

In [41]:
%%sql
desc employees99;

 * mysql://root:***@localhost/galaxy
5 rows affected.

[('employee_id', 'int(6)', 'NO', '', None, ''),
 ('first_name', 'varchar(20)', 'YES', '', None, ''),
 ('last_name', 'varchar(25)', 'NO', '', None, ''),
 ('salary', 'decimal(8,2)', 'YES', '', None, ''),
 ('department_id', 'int(4)', 'YES', '', None, '')]

In [42]:
%%sql
select * from employees99;

 * mysql://root:***@localhost/galaxy
19 rows affected.

[(100, 'Steven', 'King', Decimal('100000.00'), 90),
 (101, 'Neena', 'Kochhar', Decimal('100000.00'), 90),
 (102, 'Lex', 'De Haan', Decimal('100000.00'), 90),
 (103, 'Alexander', 'Hunold', Decimal('100000.00'), 90),
 (104, 'Bruce', 'Ernst', Decimal('100000.00'), 90),
 (107, 'Diana', 'Lorentz', Decimal('100000.00'), 90),
 (124, 'Kevin', 'Mourgos', Decimal('100000.00'), 50),
 (141, 'Trenna', 'Rajs', Decimal('100000.00'), 50),
 (142, 'Curtis', 'Davies', Decimal('100000.00'), 50),
 (143, 'Randall', 'Matos', Decimal('100000.00'), 50),
 (144, 'Peter', 'Vargas', Decimal('100000.00'), 50),
 (149, 'Eleni', 'Zlotkey', Decimal('100000.00'), 80),
 (176, 'Jonathon', 'Taylor', Decimal('100000.00'), 80),
 (178, 'Kimberely', 'Grant', Decimal('100000.00'), None),
 (200, 'Jennifer', 'Whalen', Decimal('100000.00'), 10),
 (201, 'Michael', 'Hartstein', Decimal('100000.00'), 20),
 (202, 'Pat', 'Fay', Decimal('100000.00'), 20),
 (205, 'Shelley', 'Higgins', Decimal('100000.00'), 60),
 (206, 'William', 'Gietz', Decimal('100000.00'), 60)]

In [44]:
%%sql
alter table employees99 rename column employee_id to ID;
alter table employees99 rename column department_id to dept_id;

 * mysql://root:***@localhost/galaxy
0 rows affected.
0 rows affected.

[]

In [46]:
%%sql
desc employees99;

 * mysql://root:***@localhost/galaxy
5 rows affected.

[('ID', 'int(6)', 'NO', '', None, ''),
 ('first_name', 'varchar(20)', 'YES', '', None, ''),
 ('last_name', 'varchar(25)', 'NO', '', None, ''),
 ('salary', 'decimal(8,2)', 'YES', '', None, ''),
 ('dept_id', 'int(4)', 'YES', '', None, '')]

<br><br>
<span style="color:red">[문제 6]</span>   
EMP 테이블을 삭제하라.

In [47]:
%%sql
drop table emp

 * mysql://root:***@localhost/galaxy
0 rows affected.

[]

In [49]:
%%sql
show tables;

 * mysql://root:***@localhost/galaxy
20 rows affected.

[('animals',),
 ('animals2',),
 ('countries',),
 ('departments',),
 ('dept',),
 ('dept2',),
 ('dept_sum_vu',),
 ('emp_details_view',),
 ('employees',),
 ('employees2',),
 ('employees22',),
 ('employees3',),
 ('employees99',),
 ('hire_dates',),
 ('job_grades',),
 ('job_history',),
 ('jobs',),
 ('locations',),
 ('regions',),
 ('salvu50',)]

<br><br>
<span style="color:red">[문제 7]</span>   
employees99 테이블의 이름을 EMP로 변경하라.  
(이 명령문은 배우지 않았다. 구글신에게 물어서 해결하라.)

In [50]:
%%sql
alter table employees99 rename to emp;

 * mysql://root:***@localhost/galaxy
0 rows affected.

[]

In [51]:
%%sql
desc emp;

 * mysql://root:***@localhost/galaxy
5 rows affected.

[('ID', 'int(6)', 'NO', '', None, ''),
 ('first_name', 'varchar(20)', 'YES', '', None, ''),
 ('last_name', 'varchar(25)', 'NO', '', None, ''),
 ('salary', 'decimal(8,2)', 'YES', '', None, ''),
 ('dept_id', 'int(4)', 'YES', '', None, '')]